Coding/Cpp/const.html
<?xml version="1.0" encoding="gb18030"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>关键字 const</title>
<meta http-equiv="Content-Type" content="text/html;charset=gb18030"/>
<meta name="title" content="关键字 const"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-12-14 09:03:19 CST"/>
<meta name="author" content="visayafan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<div id="org-div-comments"><a href="../../index.html#cpp">主页</a></div>


</head>
<body>


<div id="content">
<h1 class="title">关键字 const</h1>


<!-- <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script> -->
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/bootstrap_old.css" />
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/style.css" />
<script src="../../Layout/JS/jquery_1.7.1.js"></script>
<script src="../../Layout/JS/bootstrap_old.js"></script>


<ol>
<li>尽管函数名和参数列表都相同，void foo( ) const成员函数是可以与void foo( )并存的，可以形成重载! 我们假设调用语句为obj.foo()，如果obj为non-const对象，则调用foo()。如果obj为const对象，则调用foo()const。另外要注意，假如没有提供foo()const，则const obj调用foo()将会报错。但假如是没有提供foo()，则non-const obj调用foo()const是完全没有问题的。也就是说，non-const对象可以调用const函数，但const对象不能调用non-const函数.<br/>
</li>
<li>const关键字所起作用的本质，就是把隐藏着的默认的this指针参数，改成const类型。也就是说：假如void foo( )函数被编译器改写为 void foo(T* pThis)，则void foo( ) const将会被改写为void foo(const T* pThis) 。i.e. 在函数末尾添加一个const，就相当于在隐藏的this参数类型前加一个const.<br/>
</li>
<li>这样做有两个效果，第一：编译器将不允许foo()const修改pThis指向的对象的成员。第二、const对象只能调用const成员函数，否则就会报错说把const T* 转化为T* 会丢失qualifier<br/>
</li>
</ol>

<p>－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－<br/>
//Only member functions declared as const can be invoked for a class object that is const. The const keyword is placed between the parameter list and the body of the member function. A const member function defined outside the class body must specify the constkeyword in both its declaration and its definition. For example:<br/>
</p>


<pre class="src src-c++"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">Screen</span> 
{ 
    <span style="color: #a020f0;">public</span>:      
    <span style="color: #228b22;">bool</span> <span style="color: #0000ff;">isEqual</span>( <span style="color: #228b22;">char</span> <span style="color: #a0522d;">ch</span> ) <span style="color: #a020f0;">const</span>;      <span style="color: #b22222;">// </span><span style="color: #b22222;">... private:      </span>
    <span style="color: #008b8b;">string</span>::<span style="color: #228b22;">size_type</span>    <span style="color: #a0522d;">_cursor</span>;      
    <span style="color: #228b22;">string</span>               <span style="color: #a0522d;">_screen</span>;      <span style="color: #b22222;">// </span><span style="color: #b22222;">... </span>
}; 
<span style="color: #228b22;">bool</span> <span style="color: #008b8b;">Screen</span>::<span style="color: #0000ff;">isEqual</span>( <span style="color: #228b22;">char</span> <span style="color: #a0522d;">ch</span> ) <span style="color: #a020f0;">const</span> 
{      
    <span style="color: #a020f0;">return</span> ch == _screen[_cursor]; 
}

</pre>

<script src="../../Layout/JS/disqus-comment.js"></script>
<div id="disqus_thread">
</div>
</div>

</body>
</html>
